from datetime import datetime, time

import pandas as pd
import pytest


@pytest.fixture
def morning_time() -> time:
    return time(hour=8, minute=0, second=0)


@pytest.fixture
def afternoon_time() -> time:
    return time(hour=14, minute=0, second=0)


@pytest.fixture
def evening_time() -> time:
    return time(hour=20, minute=0, second=0)


@pytest.fixture
def night_time() -> time:
    return time(hour=2, minute=0, second=0)


@pytest.fixture
def sample_dataframe() -> pd.DataFrame:
    """
    Фикстура, возвращающая пример DataFrame для тестов get_card_data.
    """
    data = {
        "Номер карты": ["*1234", "*5678", "*1234", "*9012", "*5678"],
        "Сумма платежа": [-100.0, -50.0, -25.0, -75.0, -10.0],
    }
    return pd.DataFrame(data)


@pytest.fixture
def sample_dataframe_top_transactions() -> pd.DataFrame:
    """
    Фикстура, возвращающая пример DataFrame для тестов get_top_transactions.
    """
    data = {
        "Отчет по операциям": [
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -160.89,
                "Валюта операции": "RUB",
                "Сумма платежа": -160.89,
                "Валюта платежа": "RUB",
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 3,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:42:04",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -64,
                "Валюта операции": "RUB",
                "Сумма платежа": -64,
                "Валюта платежа": "RUB",
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 1,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 64,
            },
            {
                "Дата операции": "31.12.2021 16:39:04",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -118.12,
                "Валюта операции": "RUB",
                "Сумма платежа": -118.12,
                "Валюта платежа": "RUB",
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 2,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 118.12,
            },
            {
                "Дата операции": "31.12.2021 15:44:39",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -78.05,
                "Валюта операции": "RUB",
                "Сумма платежа": -78.05,
                "Валюта платежа": "RUB",
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 1,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 78.05,
            },
            {
                "Дата операции": "31.12.2021 01:23:42",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*5091",
                "Статус": "OK",
                "Сумма операции": -564,
                "Валюта операции": "RUB",
                "Сумма платежа": -564,
                "Валюта платежа": "RUB",
                "Категория": "Различные товары",
                "MCC": 5399,
                "Описание": "Ozon.ru",
                "Бонусы (включая кэшбэк)": 5,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 564,
            },
            {
                "Дата операции": "31.12.2021 00:12:53",
                "Дата платежа": "31.12.2021",
                "Статус": "OK",
                "Сумма операции": -800,
                "Валюта операции": "RUB",
                "Сумма платежа": -800,
                "Валюта платежа": "RUB",
                "Категория": "Переводы",
                "Описание": "Константин Л.",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 800,
            },
        ]
    }
    df = pd.DataFrame(data["Отчет по операциям"])
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], format="%d.%m.%Y %H:%M:%S")
    return df


@pytest.fixture
def sample_dataframe_by_month() -> pd.DataFrame:
    """
    Фикстура, возвращающая пример DataFrame с транзакциями.
    """
    data = {
        "Дата операции": [
            datetime(2024, 1, 5),
            datetime(2024, 1, 12),
            datetime(2024, 1, 20),
            datetime(2024, 2, 10),
            datetime(2024, 2, 25),
            datetime(2024, 3, 15),
        ],
        "Сумма платежа": [10, 20, 30, 40, 50, 60],
        "Категория": ["A", "B", "A", "B", "A", "B"],
    }
    return pd.DataFrame(data)
